backend/app/controllers/api/v1/companies_controller.rb

	def index
		companies = Company.all
---
SELECT "companies".* FROM "companies"

	def show
		company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

	def create
        company = Company.create(company_params)
---
INSERT INTO "companies" ("name", "description", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Larissa Nguyen"], ["description", "bleeeeeh"], ["link", "nilllll"], ["created_at", "2020-07-30 08:04:39.568627"], ["updated_at", "2020-07-30 08:04:39.568627"]]

    def destroy
        company = Company.find(params[:id])
        company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 4]]